emesene/e3/msn/xml templates/addusertogroup.xml

<?xml version="1.0" ?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Header>
        <ABApplicationHeader xmlns="http://www.msn.com/webservices/AddressBook">
            <ApplicationId>
                CFE80F9D-180F-4399-82AB-413F33A1FA11
            </ApplicationId>
            <IsMigration>
                false
            </IsMigration>
            <PartnerScenario>
                BlockUnblock
            </PartnerScenario>
        </ABApplicationHeader>
        <ABAuthHeader xmlns="http://www.msn.com/webservices/AddressBook">
            <ManagedGroupRequest>
                false
            </ManagedGroupRequest>
            <TicketToken>%s</TicketToken>
        </ABAuthHeader>
    </soap:Header>
    <soap:Body>
        <ABGroupContactAdd xmlns="http://www.msn.com/webservices/AddressBook">
            <abId>
                00000000-0000-0000-0000-000000000000
            </abId>
            <groupFilter>
                <groupIds>
                    <guid>%s</guid>
                </groupIds>
            </groupFilter>
            <contacts>
                <Contact xmlns="http://www.msn.com/webservices/AddressBook">
                    <contactInfo>
                        <passportName>%s</passportName>
                        <isSmtp>false</isSmtp>
                        <isMessengerUser>true</isMessengerUser>
                    </contactInfo>
                </Contact>
            </contacts>
            <groupContactAddOptions>
                <fGenerateMissingQuickName>
                    true
                </fGenerateMissingQuickName>
            </groupContactAddOptions>
        </ABGroupContactAdd>
    </soap:Body>
</soap:Envelope>
