data/WLM Data/NickName_change.xml

https://omega.contacts.msn.com/abservice/abservice.asmx
-----------------------
POST /abservice/abservice.asmx HTTP/1.1
Accept: text/*
SOAPAction: http://www.msn.com/webservices/AddressBook/ABContactUpdate
Content-Type: text/xml; charset=utf-8
User-Agent: MSN Explorer/9.0 (MSN 8.0; TmstmpExt)
Host: omega.contacts.msn.com
Content-Length: 2029
Connection: Keep-Alive
Cache-Control: no-cache

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
  <soap:Header>
    <ABApplicationHeader xmlns="http://www.msn.com/webservices/AddressBook">
      <ApplicationId>996CDE1E-AA53-4477-B943-2BE802EA6166</ApplicationId>
      <IsMigration>false</IsMigration>
      <PartnerScenario>ContactSave</PartnerScenario>
      <CacheKey>12r3:oor7v1zvsCWKJuVkuHVD/V55/HcIjzfc4Z5yujljk7X2iRmabuQZYoRj05nUyeUKxPMHJQe1OXEU7U/edeCmIcjQJ37EZJ/JyZkPbybDES3l68dsD4hWc5jGU6Xi9yd2dbPusrpDvDG0FOD3LYKUlYdQf4xs3Txlo4btPDbIUr4=</CacheKey>
    </ABApplicationHeader>
    <ABAuthHeader xmlns="http://www.msn.com/webservices/AddressBook">
      <ManagedGroupRequest>false</ManagedGroupRequest>
      <TicketToken>t=EwDIAcBdAAAU7/9PdvvYJ23zPPtor/FYp6zOOb+AADdyfmtG1Zfw3oZDJ9HJgwJPGj+T5TmFHq9dgM6yVb1dt0MjtExekAvS4CgCSaVHQ7T54IcDAR5ywVZBLHGfQGV2+5SdsxSLAno+pekdJhrGwZIl9ChG77ZHrSsuc4vlh+FWIHDHb4o2yf2oUvd2n+txQppFBRaA+xpGI5mbQnJ1A2YAAAjKdNXlOwo7fRgBKHz4aHLM5JRT7iju6yI0WbtlsFAcdXoFk4zPcfLzZ2+CNqUlIjgZNJ9zHMLGl5CCEa4phV1IvhLaCzx2/s+R0tgxNgJXwRc9rdfNDn7ifioWCoB1tr8z6yVaWWvT3mI5lMVXBLHWsh0shO2sJkSNl6QAYyFTDgdeve3X0/x9fzBIbKWqokupYqhFJErUhg7bS7ftdtVNz5+CPaVpDjE/6VP/7xy1Fjisq1vnRgtHalqQgSWhPotUXU0Ucs9y4WInAWDblStrWNSonD6tEsoo8VmwnC35af+r4iBLL/X5g2tA8Bll+5n4fGnwD5vJaRKy9ncg3YF3nr8NmsVjkZ7eYp1DW6NrH4qpSeM40eaz5ymYyR24fZyKezAB&amp;p=</TicketToken>
    </ABAuthHeader>
  </soap:Header>
  <soap:Body>
    <ABContactUpdate xmlns="http://www.msn.com/webservices/AddressBook">
      <abId>00000000-0000-0000-0000-000000000000</abId>
      <contacts>
        <Contact xmlns="http://www.msn.com/webservices/AddressBook">
          <contactId>4b6f3558-14c0-4491-a78d-14bffda186ae</contactId>
          <contactInfo>
            <hasSpace>true</hasSpace>
            <annotations>
              <Annotation>
                <Name>AB.NickName</Name>
                <Value>zpy</Value>
              </Annotation>
            </annotations>
          </contactInfo>
          <propertiesChanged>Annotation HasSpace</propertiesChanged>
        </Contact>
      </contacts>
    </ABContactUpdate>
  </soap:Body>
</soap:Envelope>
=====================================
HTTP/1.1 200 OK
Date: Thu, 07 Jun 2007 17:24:13 GMT
Server: Microsoft-IIS/6.0
P3P:CP="BUS CUR CONo FIN IVDo ONL OUR PHY SAMo TELo"
X-Powered-By: ASP.NET
X-MSNSERVER: BAYABCHWBB174
X-AspNet-Version: 2.0.50727
Cache-Control: private, max-age=0
Content-Type: text/xml; charset=utf-8
Content-Length: 570

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Header>
    <ServiceHeader xmlns="http://www.msn.com/webservices/AddressBook">
      <Version>
        12.03.1527.0001
      </Version>
      <CacheKeyChanged>false</CacheKeyChanged>
      <PreferredHostName>omega.contacts.msn.com</PreferredHostName>
    </ServiceHeader>
  </soap:Header>
  <soap:Body>
    <ABContactUpdateResponse xmlns="http://www.msn.com/webservices/AddressBook" />
  </soap:Body>
</soap:Envelope>